Revit 2027 API
Gradient.GradientType Property
 The property labeled "Gradient Type" from the "Gradient" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GradientType { get; }
Public Shared ReadOnly Property GradientType As String
	Get
public:
static property String^ GradientType {
	String^ get ();
}
static member GradientType : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "GradientType".
See Also
Reference
Gradient Class
Autodesk.Revit.DB.Visual Namespace